# Create and Access SQLite database using Python

## Objectives

After completing this lab you will be able to:

*   Create a database
*   Create a table
*   Insert data into the table
*   Retrieve the result set into a pandas dataframe
*   Close the database connection

In [1]:
# Importing libraries

import sqlite3
import pandas as pd

## Task 1: Create database using SQLite

In [10]:
conn=sqlite3.connect('mydatabase.db')
cursor_obj=conn.cursor()

## Task 2: Create a table in the database

In [11]:
# Creating Table

table = """ create table IF NOT EXISTS MYDATABASE(ID INTEGER PRIMARY KEY NOT NULL, FNAME VARCHAR(20), LNAME VARCHAR(20), CITY VARCHAR(20), CCODE CHAR(2));"""
 
cursor_obj.execute(table)

## Task 3: Insert data into the table

In [12]:
# First Row

cursor_obj.execute('''insert into MYDATABASE values (1, 'Jaime', 'Diaz', 'ROMA', 'IT')''')

In [13]:
# Second and third

cursor_obj.execute('''insert into MYDATABASE values (2, 'Bianca', 'Lazzaro', 'Catanzaro', 'IT'), (3, 'Luna', 'Diaz', 'Pereira', 'CO')''')

## Task 4: Retrieve data into Pandas

In [14]:
df = pd.read_sql_query("select * from MYDATABASE;", conn)
df

   ID   FNAME    LNAME       CITY CCODE
0   1   Jaime     Diaz       ROMA    IT
1   2  Bianca  Lazzaro  Catanzaro    IT
2   3    Luna     Diaz    Pereira    CO

## Task 5: Close the Connection

In [15]:
conn.close()

## Summary

In this Excercise I created a database & table in Python notebook using SQLite3. Then created a table and insert a few rows of data into it. Then queried the data. also retrieved the data into a pandas dataframe.